#ifndef HTTPSYNC_H
#define HTTPSYNC_H


#include <QString>
#include <QNetworkReply>
#include <QMutex>

class HttpSync :public QObject
{
    Q_OBJECT
public:
    /**********************************************************************
    * 函数名称： HttpSync
    * 功能描述： 构造函数
    * 输入参数：
    * 输出参数：
    * 修改日期        版本号     修改人	      修改内容
    * -----------------------------------------------
    * 2013/08/07	 V1.0
    ***********************************************************************/
   HttpSync();

   /**********************************************************************
   * 函数名称： post
   * 功能描述： 向后台发送请求
   * 输入参数：
   * 输出参数：
   * 修改日期        版本号     修改人	      修改内容
   * -----------------------------------------------
   * 2013/08/07	 V1.0
   ***********************************************************************/
    QString post(QString url, QString param);
public slots:
    /**********************************************************************
    * 函数名称： httperror
    * 功能描述： 处理链接错误
    * 输入参数：
    * 输出参数：
    * 修改日期        版本号     修改人	      修改内容
    * -----------------------------------------------
    * 2013/08/07	 V1.0
    ***********************************************************************/
    void httperror(QNetworkReply::NetworkError);
private:
    /**********************************************************************
    * 函数名称： readRespone
    * 功能描述： 读取后台返回回来的数据
    * 输入参数：
    * 输出参数：
    * 修改日期        版本号     修改人	      修改内容
    * -----------------------------------------------
    * 2013/08/07	 V1.0
    ***********************************************************************/
    void readRespone(QNetworkReply*reply,QString& respone);

private:
    QNetworkAccessManager* nam;
    QNetworkReply*    post_reply;
    QString                respone;

    bool                   isWorking;       
};


#endif // HTTPSYNC_H


